{
  "backend/main.mo": "Motoko canister defining products, orders, and user profiles with access control, plus CRUD operations and stock management.",
  "feature_evidence.json": "Feature-evidence report mapping implemented features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind CSS setup defining base variables, typography, accessibility, and motion-reduction rules.",
  "frontend/index.html": "HTML entry file loading the root React app and main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with query, identity, theme, and cart providers.",
  "frontend/src/components/blak/AdminGuard.tsx": "Component that checks Internet Identity admin permissions and conditionally renders children or access prompts.",
  "frontend/src/components/blak/CheckoutForm.tsx": "Checkout form UI handling shipping fields, validation errors, and payment method selection.",
  "frontend/src/components/blak/FadeInOnView.tsx": "Intersection Observer–based wrapper that fades elements in when they enter the viewport.",
  "frontend/src/components/blak/ImageUploadField.tsx": "Image upload component that previews an image and tracks upload progress using ExternalBlob.",
  "frontend/src/components/blak/OrderSummary.tsx": "Displays cart items with product details and calculates subtotal, shipping, and total.",
  "frontend/src/components/blak/ParallaxSection.tsx": "Section with a scroll‑based parallax background effect and overlaid content.",
  "frontend/src/components/blak/ProductCard.tsx": "Renders a product card with size selection, hover actions, and add‑to‑cart logic.",
  "frontend/src/components/blak/ShopControls.tsx": "Category, size, and sort selection controls for filtering shop products.",
  "frontend/src/components/blak/SiteLayout.tsx": "Main site layout providing header, navigation, cart indicator, content outlet, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useCompleteOrder.ts": "Mutation hook that completes an order by calling the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, managing login state and identity persistence.",
  "frontend/src/hooks/usePageMeta.ts": "Hook that updates the document title and meta description.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for fetching products and performing admin product mutations with cache invalidation.",
  "frontend/src/index.css": "Imports the global index.css stylesheet.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin interface for listing, creating, editing, and deleting products with a form dialog.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, price totals, and navigation to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders checkout form, validates user info, computes totals, and submits orders.",
  "frontend/src/pages/ContactPage.tsx": "Static contact page showing contact info and a non-functional message form.",
  "frontend/src/pages/HomePage.tsx": "Home page with parallax sections and a featured products grid.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details and navigation options after checkout.",
  "frontend/src/pages/ShopPage.tsx": "Renders the shop page with product filtering, sorting, and grid display, using hooks to load products and manage UI state. Shows loading, empty, or product results with animations.",
  "frontend/src/state/CartProvider.tsx": "Provides a React context for cart items with add, update, remove, and clear actions. Syncs cart state to local storage and loads it on initialization.",
  "frontend/src/state/cartStorage.ts": "Handles loading, saving, and clearing cart data in localStorage with error handling. Stores an array of cart items under a fixed key.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and clearing them from the hash. Supports both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors, radii, shadows, and animations, with plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing goals, requirements, aesthetic guidelines, existing features, and image needs for the BLAK e-commerce build."
}